---
kind: type
id: T:Autodesk.Revit.DB.Ellipse
source: html/b966b82f-0627-c94a-9f37-994d00bdff18.htm
---
# Autodesk.Revit.DB.Ellipse

A whole or partial ellipse.

## Syntax (C#)
```csharp
public class Ellipse : Curve
```

## Remarks
Inheritance Hierarchy System.Object    Autodesk.Revit.DB.APIObject      Autodesk.Revit.DB.GeometryObject        Autodesk.Revit.DB.Curve          Autodesk.Revit.DB.Ellipse